package com.epam.izh.rd.online.calculator;

/**
 * Реализовать класс Expression, который создается конструктором с единственным аргументом (стартовое значение) и к
 * экземпляру возможно применить следующие методы: `plus`, `minus`, `divide`, `multiply`, `sqrt`, `pow`, `mod`, `factorial`,
 * и `calculate`.
 * Пример:\
 * `new Expression(2)`\
 *      `.plus(6)`\
 *      `.divide(2)`\
 *      `.sqrt()`\
 *      `.calculate()` - возвращает ответ (в конкретном случае 2)
 * При возникновении исключительных ситуаций (например, деление на 0) должно выводиться сообщение об ошибке.
 * В методе Main необходимо написать демо, демострирующее работу данного класса.
 *
 * При возникновении исключительных ситуаций (например, деление на 0) должно выводиться сообщение об ошибке.
 * В методе Main необходимо написать демо, демострирующее работу данного класса.
 */
public class Expression {

}
